'use client'
import Link from 'next/link'
import { useRef } from 'react'
import ServiceSlider from '../sliders/service-page-slider'
export default function DobroContent() {
	const swiperRef = useRef(null)

	const images = [
		'/images/dobro/1.webp',
		'/images/dobro/2.webp',
		'/images/dobro/5.jpg',
		'/images/dobro/3.jpg',
		'/images/dobro/4.jpg',
	]
	return (
		<>
			<div className='bg-background mt-10 px-3.75'>
				<div className='container max-w-7xl mx-auto'>
					<div className='flex  gap-6 lg:gap-8 items-stretch pt-10 pb-10'>
						{/* LEFT: big card */}
						<div className='w-full lg:flex-1 bg-white rounded-[32px] p-7 sm:p-10'>
							<h2 className='text-[22px] sm:text-[28px] font-semibold text-(--accent-color) '>
								Мы открываем рубрику «Твори Добро Сегодня» 💫
							</h2>
						</div>
					</div>
					<div className='flex  gap-6 lg:gap-8 items-stretch  pb-10'>
						{/* LEFT: big card */}
						<div className='w-full lg:flex-1 bg-white rounded-[32px] p-7 sm:p-10'>
							<p className='text-[16px] sm:text-[18px] font-light text-black '>
								В суете повседневности мы часто не замечаем, какие удивительные
								события происходят вокруг и какие люди живут совсем рядом с
								нами. Совсем недавно у нас в гостях побывала талантливая девушка
								Алена Мельникова из Верх-Чебулы, ей 20 лет и она пишет картины
								носом 🌄
							</p>
							<p className='text-[16px] sm:text-[18px] font-light text-black '>
								Несмотря на ограниченные возможности здоровья, живопись Алёны
								всегда светла и радостна. Это яркие цветы, живые пейзажи и
								натюрморты. Невозможно поверить в то, что автор - девушка с
								тяжелой формой ДЦП. Передвигается Алёна на инвалидной коляске,
								общается только глазами и мимикой, руки и ноги её не слушаются,
								единственное, что она контролирует - голову.
							</p>
							<p className='text-[16px] sm:text-[18px] font-base text-black py-10 '>
								👩‍🎨С творчеством Мельниковой Алены можно познакомиться здесь:{' '}
								<Link
									href={'https://t.me/Alenamelnikova2004'}
									className='text-(--accent-color) font-semibold cursor-pointer'
								>
									t.me/Alenamelnikova2004
								</Link>
							</p>
							<p className='text-[16px] sm:text-[18px] font-base text-black pb-1'>
								Команда гостевого комплекса «Люди в уюте» была очарована юной
								художницей и впечатлена её талантом и жизнелюбием. Мы пригласили
								Алену провести время (безоплатно) в п. Шерегеш и запечатлеть
								зимние красоты нашего родного края.
							</p>
							<p className='text-[16px] sm:text-[18px] font-base text-black pb-1'>
								😍Конечно, это было необыкновенное время: Алена много рисовала,
								радовалась, часто улыбалась, наблюдала за тем, как быстро
								меняется небо за окном, а загадочная гора Зеленая то появлялась
								из-за облаков, то таинственно пропадала.
							</p>
							<p className='text-[16px] sm:text-[18px] font-base text-black pb-1'>
								❄️В течение трёх дней Алёна дышала морозным горным воздухом,
								побывала на секторе Е, много гуляла, а главное – провела это
								время на пленэре с учителем!
							</p>
							<p className='text-[16px] sm:text-[18px] font-base text-black pb-1'>
								Наставница Алёны - член союза художников России, ведущий
								преподаватель Кемеровского Областного художественного училища
								🎨Евгения Николаевна Юманова – замечательная, отзывчивая
								женщина. Все наши юные гости, находящиеся в это время в гостевом
								комплексе «Люди в уюте» побывали на мастер-классе от Елены
								Николаевны и написали свои первые картины маслом! 🖌
							</p>
							<p className='text-[16px] sm:text-[18px] font-base text-black py-10 '>
								Особую благодарность мы выражаем членам организации "ОПОРЫ
								России" . Гордимся, что живем среди столь замечательных людей!
								За три часа мы собрали денежные средства для оплаты стоимости
								проезда Алены на социальном такси из п. Верх-Чебула в п. Шерегеш
								в размере 24260 рублей. Вместе мы сила! 💪
							</p>
						</div>
					</div>
				</div>
			</div>
			<div className='w-full mb-16 bg-white sm:p-20 pb-10 pt-10 px-3.75'>
				<div className='container max-w-7xl mx-auto'>
					<ServiceSlider swiperRef={swiperRef} images={images} />
				</div>
			</div>
		</>
	)
}
