export default function OfferPage() {
	return (
		<section className='offer bg-[url("/images/contacts/policy.png")]   py-12 mt-10'>
			<div className='container max-w-7xl mx-auto px-4 sm:px-6 lg:px-8'>
				<h1 className=' text-2xl sm:text-3xl md:text-4xl font-bold text-black mb-8'>
					Договор оферты
				</h1>

				<div className='prose prose-lg max-w-none text-black'>
					<div className='space-y-8'>
						{/* Раздел 1 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								1. Общие положения
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									1.1. Настоящая Оферта, публикуемая на сайте
									https://людивуюте.рф/ является официальным предложением
									Индивидуального предпринимателя Мальцевой Натальи
									Александровны для физических и юридических лиц заключить
									Договор на оказание услуг по бронированию номеров в комплексе
									«ЛЮДИ В УЮТЕ» (далее – Комплекс). В соответствии с пунктом 2
									статьи 437 Гражданского Кодекса Российской Федерации данный
									документ является публичной Офертой.
								</p>
								<p>
									1.2. Под услугами Исполнителя в Оферте понимаются услуги
									бронирования номеров и прочих услуг в Комплексе посредством
									использования Системы бронирования.
								</p>
								<p>
									1.3. Договор на оказание услуг по бронированию заключается
									путем акцепта данной Оферты, содержащей все существенные
									условия Договора на оказание услуг по бронированию, без
									подписания сторонами. Договор на оказание услуг по
									бронированию имеет юридическую силу в соответствии со ст. 434
									Гражданского кодекса Российской Федерации и является
									равносильным договору, подписанному сторонами. Договор на
									оказание услуг по бронированию считается заключенным и
									приобретает силу с момента акцепта Оферты, а именно совершения
									Заказчиком действий, предусмотренных в п. 4.1. настоящей
									Оферты и означающих безоговорочное присоединение Заказчика ко
									всем условиям Оферты без каких-либо изъятий или ограничений.
								</p>
							</div>
						</section>

						{/* Раздел 2 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								2. Предмет Договора
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									2.1. Предметом настоящей Оферты является бронирование и
									реализация Заказчику услуг Комплекса на условиях данной
									Оферты.
								</p>
								<p>
									2.2. Бронирование осуществляется в порядке, указанном в
									Правилах проживания, которые являются неотъемлемой частью
									Договора на оказание услуг по бронированию и представлены на
									сайте Комплекса.
								</p>
								<p>
									2.3. Заказчик обязуется принимать оказанные услуги и
									осуществлять необходимые платежи в соответствии с условиями
									данной Оферты.
								</p>
							</div>
						</section>

						{/* Раздел 3 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								3. Права и обязанности Заказчика и Исполнителя
							</h2>

							<div className='space-y-6'>
								{/* Права Заказчика */}
								<div>
									<h3 className='text-xl font-medium mb-3'>
										3.1. Права Заказчика:
									</h3>
									<div className='space-y-2 ml-6'>
										<p>
											<strong>3.1.1.</strong> Производить поиск, бронирование и
											оплату услуг Комплекса посредством Системы и прочими
											способами, указанными на сайте Комплекса. Заказчик
											признает, что в случае использования Системы он в полной
											мере и безоговорочно принимает условия данной Оферты вне
											зависимости от того, каким способом было совершено
											бронирование и оплата бронирования.
										</p>
										<p>
											<strong>3.1.2.</strong> Отказаться от бронирования или
											изменить бронирование на условиях, оговоренных в п. 6
											настоящей Оферты.
										</p>
										<p>
											<strong>3.1.3.</strong> Заказчик имеет право на получение
											забронированных услуг в сроки и в объеме, оговоренные в
											бронировании.
										</p>
									</div>
								</div>

								{/* Права Исполнителя */}
								<div>
									<h3 className='text-xl font-medium mb-3'>
										3.2. Права Исполнителя:
									</h3>
									<div className='space-y-2 ml-6'>
										<p>
											<strong>3.2.1.</strong> Требовать от Заказчика соблюдения
											Правил проживания, опубликованных на сайте Комплекса и
											указанных в данной Оферте. Исполнитель несет
											ответственность за надлежащее исполнение Договора на
											оказание услуг по бронированию только в случае действий и
											процедур, совершенных Заказчиком с полным соблюдением этих
											правил.
										</p>
										<p>
											<strong>3.2.2.</strong> Требовать от Заказчика полного
											согласия с условиями Оферты. Без согласия с условиями
											Оферты отказать Заказчику в оказании услуг.
										</p>
										<p>
											<strong>3.2.3.</strong> Требовать от Заказчика оплаты
											бронирования.
										</p>
										<p>
											<strong>3.2.4.</strong> Удерживать с Заказчика или
											требовать оплаты штрафных санкций в случае изменения,
											отказа от бронирования или не заезда в Комплекс.
											Удерживать с Заказчика или требовать оплаты всех расходов,
											фактически понесенных Исполнителем при оказании услуг, в
											том числе комиссии банков и (или) платежных систем,
											уплаченные как при оплате, так и при возврате денежных
											средств. При этом Заказчик признает действия Исполнителя
											полностью правомерными, считает их справедливыми и
											лишёнными признака кабальности.
										</p>
										<p>
											<strong>3.2.5.</strong> Привлекать третьих лиц для
											исполнения услуг по бронированию в целях Договора на
											оказание услуг по бронированию.
										</p>
										<p>
											<strong>3.2.6.</strong> Расторгнуть Договор на оказание
											услуг по бронированию в одностороннем внесудебном порядке,
											если Заказчик предоставил Исполнителю недостоверные
											сведения или контактные данные, а также заведомо ложные
											и/или неправомерно используемые Заказчиком данные
											платежных карт.
										</p>
										<p>
											<strong>3.2.7.</strong> В случае утраты или повреждения
											имущества, Заказчик обязан возместить стоимость
											нанесенного ущерба, согласно оценке Комплекса.
										</p>
									</div>
								</div>

								{/* Обязанности Заказчика */}
								<div>
									<h3 className='text-xl font-medium mb-3'>
										3.3. Обязанности Заказчика:
									</h3>
									<div className='space-y-2 ml-6'>
										<p>
											<strong>3.3.1.</strong> Не приступать к оформлению
											бронирования, предварительно не ознакомившись с настоящей
											Офертой, Политикой конфиденциальности и Правилами
											проживания. Если Заказчик приступил к оформлению
											бронирования, то Исполнитель считает, что Заказчик
											полностью ознакомлен и согласен с условиями Оферты,
											Политикой конфиденциальности и Правилами проживания.
										</p>
										<p>
											<strong>3.3.2.</strong> Самостоятельно знакомиться на
											сайте Комплекса с информацией о Комплексе и его услугах,
											включая цены.
										</p>
										<p>
											<strong>3.3.3.</strong> Указывать актуальную контактную
											информацию при оформлении бронирования (ФИО, номер
											телефона, адрес электронной почты), необходимую
											Исполнителю для оперативной связи с Заказчиком.
										</p>
										<p>
											<strong>3.3.4.</strong> Предоставить все необходимые для
											оформления бронирования актуальные данные о заезжающих в
											Комплекс лицах и проверить их корректность.
										</p>
										<p>
											<strong>3.3.5.</strong> Своевременно оплатить стоимость
											бронирования любым из предложенных вариантов и способов
											оплаты, представленных на сайте Комплекса, в сроки и на
											условиях, указанные Исполнителем в Правилах проживания.
										</p>
										<p>
											<strong>3.3.6.</strong> В случае оплаты бронирования
											банковской картой через Интернет необходимо пользоваться
											только банковской картой, принадлежащей Заказчику
											(ответственный гость). Во избежание мошенничества
											Исполнитель проверяет платеж и для разрешения возникших
											вопросов связывается с Заказчиком. В случае если Заказчик
											недоступен или вопрос остается нерешенным, Исполнитель
											оставляет за собой право аннулировать данное бронирование
											и возвращает денежные средства на банковскую карту ее
											владельца.
										</p>
										<p>
											<strong>3.3.7.</strong> В случае отказа от бронирования
											или от части услуг в бронировании, а также для изменения
											заказанных услуг, незамедлительно сообщить об этом
											Исполнителю. При этом Заказчик обязан компенсировать
											Исполнителю все фактические расходы, понесенные им в связи
											с исполнением обязательств по Договору на оказание услуг
											по бронированию, в том числе штрафные санкции, уплаченные
											Исполнителем третьим лицам.
										</p>
										<p>
											<strong>3.3.8.</strong> Если иное не предусмотрено
											Договором на оказание услуг по бронированию и не следует
											из существа обязательств или требования закона, договорные
											права и обязанности Заказчика распространяются также на
											лиц, в интересах которых заключен Договор на оказание
											услуг по бронированию.
										</p>
									</div>
								</div>

								{/* Обязанности Исполнителя */}
								<div>
									<h3 className='text-xl font-medium mb-3'>
										3.4. Обязанности Исполнителя:
									</h3>
									<div className='space-y-2 ml-6'>
										<p>
											<strong>3.4.1.</strong> Предоставить Заказчику на сайте
											необходимую информацию о Комплексе и его услугах, а также
											инструкции для оформления и оплаты бронирования.
										</p>
										<p>
											<strong>3.4.2.</strong> Принять оплату бронирования от
											Заказчика (в том числе через третьих лиц) после
											надлежащего оформления бронирования и успешного
											бронирования услуг.
										</p>
										<p>
											<strong>3.4.3.</strong> При отмене бронирования
											подтвердить аннуляцию услуг с выставлением штрафных
											санкций, если таковые действуют на данный срок аннуляции.
										</p>
									</div>
								</div>
							</div>
						</section>

						{/* Раздел 4 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								4. Акцепт Оферты и заключение Договора
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									4.1. Заказчик производит Акцепт Оферты путем выполнения
									следующих действий в Системе:
								</p>
								<ul className='list-disc ml-8 space-y-1'>
									<li>Бронирование,</li>
									<li>Оплата.</li>
								</ul>
								<p>
									Бронирование является гарантированным исключительно при
									внесении оплаты Заказчиком.
								</p>
							</div>
						</section>

						{/* Раздел 5 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								5. Порядок осуществления платежей
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									5.1. Стоимость услуг указывается на сайте Исполнителя и в
									бронировании, сформированном Заказчиком в соответствии с
									выбранным набором услуг.
								</p>
								<p>
									5.2. На сайте действует динамическое ценообразование: цена
									бронирования зависит от сезонности, спроса и загрузки
									Комплекса.
								</p>
								<p>
									5.3. Все расчеты по Договору на оказание услуг по бронированию
									производятся в рублях РФ.
								</p>
								<p>
									5.4. Оплата бронирования производится в соответствии с
									Правилами проживания. В зависимости от условий, установленных
									Исполнителем, оплата может производиться в различных
									вариантах:
								</p>
								<ul className='list-disc ml-8 space-y-1'>
									<li>100 (Сто) – процентная предоплата,</li>
									<li>
										Частичная предоплата при бронировании с доплатой при
										заселении в Комплекс (при условии бронирования через
										менеджера).
									</li>
									<li>
										Оплата в Комплексе при заселении (при условии бронирования
										через менеджера).
									</li>
								</ul>
								<p>
									Срок оплаты устанавливается в зависимости от выбранного
									способа оплаты (наличные, платежные системы, банковским
									переводом, кредитной картой).
								</p>
							</div>
						</section>

						{/* Раздел 6 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								6. Отмена, изменение бронирование и возврат денежных средств
								Заказчику
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									6.1. До оплаты Заказчик может в любой момент отказаться от
									бронирования или внести изменения в бронирования.
								</p>
								<p>
									6.2. При отмене оплаченного бронирования (либо не заезде в
									Комплекс) в соответствии с условиями, которые были приняты
									Заказчиком при бронировании, могут быть применены штрафные
									санкции, размер которых определяется условиями Исполнителя.
									Кроме того, Исполнитель вправе удерживать с Заказчика или
									требовать оплаты всех расходов, фактически понесенных
									Исполнителем при оказании услуг, в том числе комиссии банков и
									(или) платежных систем, уплаченные как при оплате, так и при
									возврате денежных средств.
								</p>
								<p>
									6.3. Отказаться от оплаченного бронирования Заказчик может
									самостоятельно, аннулировав бронирование до наступления
									штрафных санкций в порядке, установленном в Правилах
									проживания.
								</p>
								<p>
									6.4. Изменить оплаченное бронирование или отказаться от него
									после наступления срока штрафных санкций Заказчик может только
									после согласования с Исполнителем в письменной форме.
								</p>
								<p>
									6.5. Возврат денежных средств Заказчику в случае отмены
									бронирования или не заезда в Комплекс, производится в порядке
									и на условиях, указанных в Правилах проживания.
								</p>
								<div className='bg-muted p-5 rounded-lg my-4'>
									<p>
										Денежные средства будут возвращены в течение 7-14 рабочих
										дней, в некоторых случаях до 30 рабочих дней, с момента
										принятия заявления. Сроки возврата зависят от способа оплаты
										и Банка. Денежные средства возвращаются тем же способом,
										которым был произведен платеж, на ту же банковскую карту,
										которой было оплачено бронирование. Банковские реквизиты для
										перечисления Вы можете найти в личном кабинете своего Банка.
									</p>
									<p className='mt-3'>
										Указанные правила не распространяются на случаи ЧС и
										экстремальных погодных условий. В случае наступления ЧС или
										экстремальных погодных условий уплаченные денежные средства
										полностью возвращаются если иного не указано в условиях
										тарифа.
									</p>
								</div>
							</div>
						</section>

						{/* Раздел 7 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								7. Ответственность. Разрешение споров
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									7.1. Заказчик представляет интересы всех лиц, указанных в
									бронировании, и персонально несет ответственность перед
									Исполнителем за правильность данных о них, выполнение всеми
									лицами всех обязательств, включая обязательства по оплате
									бронирования и оплате штрафа в случае отказа от оказания услуг
									(включая не заезд в Комплекс).
								</p>
								<p>
									7.2. Заказчик несет ответственность за выполнение своих
									обязательств перед Исполнителем с причинением, как
									материального ущерба, так и ущерба его деловой репутации.
									Любое неверное или мошенническое бронирование или перепродажа
									бронирования, безусловно, запрещается.
								</p>
								<p>
									7.3. Исполнитель несет ответственность за материальный ущерб,
									причиненный Заказчику в связи с не предоставлением Заказчику
									по вине Исполнителя услуг в объеме, оговоренном в
									бронировании, в порядке, установленном законодательством РФ,
									за исключением случаев, когда нарушение прав Заказчика
									произошло вследствие действий непреодолимой силы.
								</p>
								<p>
									7.4. Исполнитель не несет ответственности в случае
									неисполнения или ненадлежащего исполнения услуг со своей
									стороны или со стороны третьих лиц, возникшего из-за
									недостоверности, недостаточности или несвоевременности
									сведений и документов, предоставленных Заказчиком, а также
									возникших вследствие других нарушений условий Договора на
									оказание услуг по бронированию и/или Правил проживания со
									стороны Заказчика.
								</p>
								<p>
									7.5. Исполнитель не несет ответственности перед Заказчиком в
									случае опоздания к сроку заселения в Комплекс более чем на 1
									сутки или досрочного выезда.
								</p>
								<p>
									7.6. Исполнитель имеет возможность корректировать свою
									информацию в Системе (в том числе цены и наличие номеров) и
									несет ответственность за ее актуальность и достоверность.
								</p>
								<p>
									7.7. Исполнитель не несет ответственности за несоответствие
									предоставленного обслуживания ожиданиям Заказчика и его
									субъективной оценке.
								</p>
								<p>
									7.8. В случае возникновения претензий в период пребывания в
									Комплексе, Заказчик должен обратиться к представителю
									Комплекса для устранения недостатков оказания услуг. Стороны
									будут прилагать все усилия с целью достижения согласия по
									спорным вопросам путем переговоров с учетом условий настоящей
									Оферты.
								</p>
								<p>
									7.9. Исполнитель не несет ответственность перед Заказчиком за
									прямые или косвенные убытки и/или упущенную выгоду, возникшую
									вследствие временного отсутствия мобильной (сотовой) связи
									и/или доступа к сети Интернет и/или перебоев в их
									осуществлении и/или электричества на территории Комплекса, а
									также за иные обстоятельства вне зоны контроля Комплекса.
								</p>
								<p>
									7.10. Исполнитель не несет ответственности за причинение
									ущерба здоровью Заказчику в случае употребления им продуктов
									питания и напитков, приобретенных вне Комплекса и у третьих
									лиц.
								</p>
								<p>
									7.11. Исполнитель несет ответственность перед Заказчиком в
									рамках Договора на оказание услуг по бронированию.
								</p>
								<p>
									7.12. По всем остальным вопросам, не предусмотренным в
									настоящей Оферте, Стороны руководствуются действующим
									законодательством Российской Федерации. Все возможные споры,
									вытекающие из положений Оферты, будут разрешаться в судах
									Российской Федерации в соответствии с действующим
									законодательством Российской Федерации.
								</p>
							</div>
						</section>

						{/* Раздел 8 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								8. Соблюдение конфиденциальности
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									8.1. Заказчику гарантируется конфиденциальность данных,
									предоставленных им при регистрации в Системе, оформлении и
									оплате бронирования. Эта информация необходима для обработки
									бронирования и завершения процедуры бронирования (включая
									подтверждение бронирования, которое будет отправлено на
									электронный адрес Заказчика). Акцептом настоящей Оферты
									Заказчик дает свое Согласие, равносильное письменному, на
									обработку Исполнителем всех персональных данных, полученных от
									Заказчика в соответствии с Политикой конфиденциальности.
								</p>
								<p>
									8.2. Согласие Заказчика действует бессрочно и может быть
									отозвано только при наличии нарушений со стороны Исполнителя
									Федерального закона N 152-ФЗ от 27.07.2006 г.
								</p>
								<p>
									8.3. Исполнитель вправе хранить персональные данные,
									использовать их для установления контакта с Заказчиком, для
									составления документов, предоставлять персональные данные
									платежным системам, а также уполномоченным органам и
									использовать персональные данные для других нужд, связанных с
									оказанием услуг. Исполнитель не будет предоставлять
									персональные сведения третьим сторонам без согласия Заказчика,
									за исключением случаев, предусмотренных соответствующим
									законодательством РФ.
								</p>
							</div>
						</section>

						{/* Раздел 9 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								9. Обстоятельства непреодолимой силы
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									9.1. Стороны освобождаются от ответственности за полное или
									частичное неисполнение своих обязательств по Договору на
									оказание услуг по бронированию, если такое неисполнение
									явилось следствием обстоятельств непреодолимой силы, то есть
									чрезвычайных и непредотвратимых в данных условиях
									обстоятельств.
								</p>
								<p>
									9.2. К обстоятельствам непреодолимой силы, относятся, но ими
									не ограничиваются: стихийные бедствия, военные действия,
									забастовки в отрасли или регионе, действия и решения
									государственных органов власти, сбои, возникающие в
									телекоммуникационных и энергетических сетях, действия
									вредоносных программ, а также недобросовестные действия
									третьих лиц, направленных на несанкционированный доступ и/или
									выведение из строя программного и/или аппаратного комплекса
									каждой из Сторон.
								</p>
							</div>
						</section>

						{/* Раздел 10 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								10. Изменение и расторжение Договора
							</h2>
							<div className='space-y-3 ml-4'>
								<p>
									10.1. Договор на оказание услуг по бронированию считается
									заключенным с момента акцепта Заказчиком настоящей Оферты и
									действует до исполнения сторонами всех своих обязательств по
									Договору на оказание услуг по бронированию.
								</p>
								<p>
									10.2. Исполнитель вправе в одностороннем внесудебном порядке
									отказаться от исполнения Договора на оказание услуг по
									бронированию.
								</p>
								<p>
									10.3. Исполнитель вправе изменять условия настоящей Оферты,
									вводить новые Приложения к ней без предварительного
									уведомления Заказчика. Зная о возможности таких изменений,
									Заказчик согласен с тем, что они будут производиться. Если
									Заказчик продолжает пользоваться услугами Исполнителя после
									таких изменений, это означает его согласие с ними.
								</p>
							</div>
						</section>

						{/* Раздел 11 */}
						<section>
							<h2 className='text-2xl font-semibold mb-4'>
								11. Реквизиты Исполнителя
							</h2>
							<div className='bg-muted p-5 rounded-lg'>
								<p className='mb-2'>
									<strong>
										Индивидуальный предприниматель Мальцева Наталья
										Александровна
									</strong>
								</p>
								<p className='mb-1'>
									<strong>Адрес, место нахождения:</strong> Кемеровская область
									- Кузбасс, муниципальный район Таштагольский, городское
									поселение Шерегешское, поселок городского типа Шерегеш, улица
									Звездная, 8
								</p>
								<p className='mb-1'>
									<strong>ИНН:</strong> 420213742466
								</p>
								<p>
									<strong>ОГРНИП:</strong> 314420212800017
								</p>
							</div>
						</section>
					</div>
				</div>
			</div>
		</section>
	)
}
